{
    "ESFJ":
    [
        "ESFJs are known for their deep sense of compassion, and their practical kindness and generosity. ESFJs use a combination of Extraverted Feeling (Fe) to empathize and relate to others, as well as Introverted Sensing (Si) to have a proficient memory of details and a knack for utilitarian, down-to-earth knowledge. They are understanding teachers, excellent motivators, and productive and helpful members of their communities. Some famous ESFJs include Pope Francis, Andrew Carnegie, Sam Walton, and Anne Hathaway."
    ],
    "ISFJ":
    [
        "ISFJs are known for their compassion, dutifulness, and practical kindness. Down-to-earth and empathetic, they make sure that details are taken care of so that life is calm, tranquil, and stable. They thrive when helping their loved ones in practical ways and doing what they can to improve their communities. Calm and soft-spoken, they avoid being showy or attention-seeking, instead preferring to do their kind deeds in the background without a lot of fanfare. "
    ],
    "ESTJ":
    [
        "ESTJs are known for their hard-working, swift-thinking demeanor and their astounding ability to produce rapid results for their efforts. They are often referred to as The Guardians, and this is because they believe strongly in protecting laws, traditions, standards, and their beliefs. The ESTJ is a take-charge person, with a clear vision of how things should be and a knack for leadership and organization. ESTJs believe in responsibility, following through on their commitments, being moral citizens, and being competent in their careers and duties. "
    ],
    "ISTJ":
    [
        "ISTJs are known for their quiet integrity, their resolve, and their keen eye for detail. They are often called The Duty Fulfillers, and they live up to this name by following through on their words and keeping their responsibilities. ISTJs may not say a lot, but internally they collect numerous facts from the world around them and store these facts carefully in their memory."
    ],
    "ENFJ":
    [
        "ENFJs are known for their unique ability to inspire people and bring about positive change in communities and cultures. They are intensely insightful about the human condition and have a knack for seeing into each individual’s unique potential. They are often called The Givers or The Protagonists because they believe so strongly in compassionately serving the human race and improving the world."
    ],
    "INFJ":
    [
        "INFJs are deep, insightful personalities combine perception, intellect, and empathy to “read” people in a way that is almost uncanny. They seem to intuitively understand people and situations and how events will unfold, which is why many refer to them as “the advocates.” With their highly-developed intuition, they are constantly looking ahead to determine what will happen in the future."
    ],
    "ENFP":
    [
        "ENFP personality types are known for their incredible way of inspiring and bringing out the beauty and imagination in everyday life. Because of their intuitive, adventurous nature, they have a way of infusing excitement into every day life. Along with their eye for possibility, these personalities also have a deep love of humanity and the world itself. Because of this, they excel at careers that make use of their creativity, people skills, and ability to think outside the box. "
    ],
    "INFP":
    [
        "INFPs are the people who keep imagination alive and well in the world around us. Their inner worlds are vast, lush, and filled with magical or transformative possibilities. For the INFP, listening and exploration drive them. They want to understand themselves and their unique path in life. Chances are, it’s nothing traditional or mainstream. When people talk to them, they take time to comprehend what those people really mean. Rather than formulating their own responses in a rush, they instead give others a chance to be truly “seen” and listened to. "
    ],
    "ESFP":
    [
        "ESFPs are known for their boundless optimism, their enthusiastic charm, and their ability to bring people together in friendship and celebration. They are often called The Entertainers, and it’s not hard to see why. They love to bring joy and fun into any situation; whether it’s through humor, throwing a party, or just providing cheerful support to friends and family members."
    ],
    "ISFP":
    [
        "ISFP personality types are known for their strong empathy, compassion, and gentleness when dealing with people. They have strong inner values that they may not share readily with others, but these values lay the foundation for all their beliefs and actions. As sensing types, ISFPs have a keen eye for beauty and details in their outer world. They are often drawn to careers in art, performance, crafting, dancing, fashion, or anything that allows them to be visually expressive or create beauty in some tangible way."
    ],
    "ESTP":
    [
        "ESTPs are known for their exciting, action-oriented personalities and their skill at living totally in the moment. They are often called The Doers and it’s not hard to see why. They thrive on seeing opportunities as they arise and making the most of them. They enjoy a fast-paced lifestyle with new and exciting challenges at every turn. They are intensely logical, but also have a devil-may-care charm that makes them fun and thrilling to be around."
    ],
    "ISTP":
    [
        "ISTPs are known for their quiet intensity, their fearlessness, and their ability to think quickly in a crisis. They combine a masterful use of Introverted Thinking (Ti) to form deep, logical conclusions and to stay objective in decision making. They use their sensing side to act quickly and with a detailed awareness of their physical environment.You’ll see many ISTPs throughout history and in the arts; people like Samurai author Miyamoto Musashi, Congressman Ron Paul, actor Clint Eastwood, and actress Scarlett Johansson."
    ],
    "ENTJ":
    [
        "ENTJ personality types are known for their strong intellectual presence and an impressive ability to meet goals and innovate with precision and speed. They make great leaders and entrepreneurs, and are often seen with achievements in the world of politics, business, and physics."
    ],
    "INTJ":
    [
        "INTJs are the intellectual, quick-thinking masterminds of the Myers-Briggs® world. Known for their strategic prowess and powerful insights, they live with a constant thirst for knowledge and discovery. They rely on their dominant function, Introverted Intuition (Ni) to see hidden patterns and meanings for the future. They have extremely accurate and astute perceptions about how various plans and concepts could develop over time. INTJ personality types also use Extraverted Thinking (Te) to form efficient, strategic plans, create new theories, and organize their world in a logical way."
    ],
    "ENTP":
    [
        "ENTPs are the idea people of the world; they are in love with possibilities and strategizing for the future. They combine their dominant Extraverted Intuition (Ne) with Introverted Thinking (Ti) to see numerous potential outcomes and sort them out logically in their minds. They are masters at coming up with innovative, enterprising plans of action. In communication, they tend to make charming conversationalists, witty responders, and excellent debaters."
    ],
    "INTP":
    [
        "INTP personality types are known for their rich intellectual curiosity and innovative ways of seeing the world. They have an endless thirst for knowledge, and love to experiment with new angles and methods of solving problems. It’s no wonder they are often called the prodigies or the logicians!. Patience is a hallmark of the INTP type. They hate to be rushed, and instead take their time to explore new depths of knowledge and information that others may have passed by in their hurry. INTPs use their masterful Introverted Thinking to analyze information, find leverage points, and weigh options when making decisions. They use their Intuition to see things from multiple angles and to bring a curiosity and open-mindedness to all their endeavors."
    ]

}